---
kind: method
id: M:Autodesk.Revit.DB.MEPCalculationServerInfo.#ctor
source: html/5688d6a8-9365-d616-00fe-78ad618c53f2.htm
---
# Autodesk.Revit.DB.MEPCalculationServerInfo.#ctor Method

Constructs a new MEPCalculationServerInfo with default settings.

## Syntax (C#)
```csharp
public MEPCalculationServerInfo()
```